
// 6. Напишите программу, которая на вход принимает
//  число и выдаёт, является ли число чётным 
//  (делится ли оно на два без остатка).
Console.Write(" number ");
int num = int.Parse(Console.ReadLine());
String res = (num%2 == 0) ? "ДА" : "НЕТ";
Console.Write(res);








