// 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

Console.Write(" Print num ");
int number1 = int.Parse(Console.ReadLine());
if (number1 == 6 | number1 == 7) Console.Write(" Da ");
else Console.Write(" Net ");



